app/views/artists/show.html.erb

SELECT "albums".* FROM "albums" WHERE (artists_id = '1')
SELECT COUNT(*) FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", 1]]
---
  <div class="row">
  	<h3>Albums (<%= @artists.albums.count %>)</h3>