app/controllers/artists_controller.rb

  def show
  	@albums   = Album.where("artists_id = ?", params[:id])
  	@artists  = Artist.find(params[:id])
  	@cant_albums = Album.select("count(*) as cant_albums").where("artists_id = ?", params[:id])
---
SELECT "albums".* FROM "albums" WHERE (artists_id = '1')
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", 1]]